# Padas_data_frame
collection of pandas series or multi-dimensional data is called data frame of pandas

In [6]:
import pandas as pd
apple=pd.Series([1,2,3,4,5,6,])
banana=pd.Series([11,22,33,44,55,66])
#print(banana,apple)
data={'apple':apple,'banana':banana}
fruit_df=pd.DataFrame(data)
print(fruit_df)

   apple  banana
0      1      11
1      2      22
2      3      33
3      4      44
4      5      55
5      6      66

In [7]:

apple=pd.Series([3,2,5,4,8,9,1],index=['a','s','d','f','g','h','j'])
banana=pd.Series([1,4,3,6,7,8,2], index=['mo','tu','we','th','fr','st','su'])
#print(banana,apple)
data={'apple':apple,'banana':banana}
fruit_df=pd.DataFrame(data)
print(fruit_df)

    apple  banana
a     3.0     NaN
d     5.0     NaN
f     4.0     NaN
fr    NaN     7.0
g     8.0     NaN
h     9.0     NaN
j     1.0     NaN
mo    NaN     1.0
s     2.0     NaN
st    NaN     8.0
su    NaN     2.0
th    NaN     6.0
tu    NaN     4.0
we    NaN     3.0

In [12]:
print('mo' in apple)
print('st' in banana)

False
True

In [15]:
data_of_dist={'dist':['chitral','dir','sawat','mardan','sawabi'],
     'pop':[111,2222,1111,2222,333,],
     'years':[2015,2016,2017,2018,2019,]}
dist_pop_df=pd.DataFrame(data_of_dist ,index=['i','ii','iii','iv','v'])
dist_pop_df

        dist   pop  years
i    chitral   111   2015
ii       dir  2222   2016
iii    sawat  1111   2017
iv    mardan  2222   2018
v     sawabi   333   2019

In [16]:
dist_pop_df.head()# it will print top five elements

        dist   pop  years
i    chitral   111   2015
ii       dir  2222   2016
iii    sawat  1111   2017
iv    mardan  2222   2018
v     sawabi   333   2019

In [25]:
dist_pop_df2=pd.DataFrame(data_of_dist ,columns=['dist','pop','years','debt'],index=['i','ii','iii','iv','v'])
dist_pop_df2.head()

        dist   pop  years debt
i    chitral   111   2015  NaN
ii       dir  2222   2016  NaN
iii    sawat  1111   2017  NaN
iv    mardan  2222   2018  NaN
v     sawabi   333   2019  NaN

In [20]:
print(dist_pop_df2.columns)
print(dist_pop_df2.index)

Index(['dist', 'pop', 'years', 'debt'], dtype='object')
Index(['i', 'ii', 'iii', 'iv', 'v'], dtype='object')

In [21]:
#for accesing data
dist_pop_df2['dist']

i      chitral
ii         dir
iii      sawat
iv      mardan
v       sawabi
Name: dist, dtype: object

In [22]:
dist_pop_df2.years#attribute like

i      2015
ii     2016
iii    2017
iv     2018
v      2019
Name: years, dtype: int64

In [23]:
dist_pop_df2.loc['iv']

dist     mardan
pop        2222
years      2018
debt        NaN
Name: iv, dtype: object

In [26]:
import numpy as np
import pandas as pd
dist_pop_df2=pd.DataFrame(data_of_dist ,columns=['dist','pop','years','debt'],index=['i','ii','iii','iv','v'])
ln=len(dist_pop_df2)
rnge=np.arange(ln)
#print(dist_pop_df2)
dist_pop_df2['debt']=rnge
print(dist_pop_df2)

        dist   pop  years  debt
i    chitral   111   2015     0
ii       dir  2222   2016     1
iii    sawat  1111   2017     2
iv    mardan  2222   2018     3
v     sawabi   333   2019     4

In [27]:
vlue=pd.Series([0.01,0.71,0.112,0.45,0.732],index=['i','ii','iii','iv','v'])

In [28]:
dist_pop_df2['debt']=vlue
dist_pop_df2

        dist   pop  years   debt
i    chitral   111   2015  0.010
ii       dir  2222   2016  0.710
iii    sawat  1111   2017  0.112
iv    mardan  2222   2018  0.450
v     sawabi   333   2019  0.732